XCADeferred/2019-01-09 Sample Deferred Query Request.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <S:Header>
        <wsa:Action>urn:ihe:iti:2007:Deferred:CrossGatewayQuery</wsa:Action>
        <wsa:MessageID>uuid:df9b89ed-395e-40a7-8510-0b4a390434c4</wsa:MessageID>
    </S:Header>
    <S:Body>
        <query:AdhocQueryRequest xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0">
            <rs:RequestSlotList>
                <rim:Slot name="$XDSDeferredResponseEndpoint">
                    <rim:ValueList>
                        <rim:Value>'https://myorg.com/my_response_endpoint'</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
            </rs:RequestSlotList>
            <query:ResponseOption returnComposedObjects="true" returnType="LeafClass"/>
            <rim:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
                <rim:Slot name="$XDSDocumentEntryPatientId">
                    <rim:ValueList>
                        <rim:Value>'N600001^^^&amp;2.16.840.1.113883.3.333&amp;ISO'</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
                <rim:Slot name="$XDSDocumentEntryStatus">
                    <rim:ValueList>
                        <rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
            </rim:AdhocQuery>
        </query:AdhocQueryRequest>
    </S:Body>
</S:Envelope>
