examples/iti18_request_query.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing"
            xmlns:s="http://www.w3.org/2003/05/soap-envelope">
   <s:Header>
      <a:Action s:mustUnderstand="1">urn:ihe:iti:2007:RegistryStoredQuery</a:Action>
      <a:MessageID>urn:uuid:6d63ca0c-4fb5-4bac-b60b-fcc4e4ef52b3</a:MessageID>
      <a:ReplyTo>
         <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
      </a:ReplyTo>
      <a:To s:mustUnderstand="1">http://localhost:9091/xds-iti18</a:To>
   </s:Header>
	<s:Body xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<query:AdhocQueryRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:xdsb="urn:ihe:iti:xds-b:2007" xmlns:xop="http://www.w3.org/2004/08/xop/include">
    <query:ResponseOption returnComposedObjects="true" returnType="LeafClass"></query:ResponseOption>
    <rim:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
        <rim:Slot name="$XDSDocumentEntryPatientId">
            <rim:ValueList>
                <rim:Value>'121212^^^&amp;1.3.4.5&amp;ISO'</rim:Value>
            </rim:ValueList>
        </rim:Slot>
        <rim:Slot name="$XDSDocumentEntryStatus">
            <rim:ValueList>
                <rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</rim:Value>
            </rim:ValueList>
        </rim:Slot>
    </rim:AdhocQuery>
	</query:AdhocQueryRequest>
	</s:Body>
</s:Envelope>

